/****************************************************************************/
/* 対象マイコン R8C/38A                                                     */
/* ﾌｧｲﾙ内容     パソコンからサーボの最大切れ角を調べる(R8C/38A版)           */
/* バージョン   Ver.1.00                                                    */
/* Date         2012.05.07                                                  */
/* Copyright    ジャパンマイコンカーラリー実行委員会                        */
/****************************************************************************/
/*
マイコンカーの実際の最大切れ角を確かめるチェックプログラムです。
下記の１キーを押すごとに説明のような動きをします。

'Z'キー     ：サーボオフセット値－1
'X'キー     ：サーボオフセット値＋1
'A'キー     ：サーボオフセット値－3
'S'キー     ：サーボオフセット値＋3

接続は、
・伝送ケーブル←→パソコン(通信ソフトはTeraTermProかハイパーターミナル)
・P2←モータドライブ基板Ver.5←サーボ
です。
*/

/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "sfr_r838a.h"                  /* R8C/38A SFRの定義ファイル    */
#include "printf_lib.h"                 /* printf使用ライブラリ         */

/*======================================*/
/* シンボル定義                         */
/*======================================*/
#define SERVO_CENTER    3750            /* サーボのセンタ値             */

/*======================================*/
/* プロトタイプ宣言                     */
/*======================================*/
void init( void );

/*======================================*/
/* グローバル変数の宣言                 */
/*======================================*/
int     servo_angle;                    /* サーボ角度                   */

/************************************************************************/
/* メインプログラム                                                     */
/************************************************************************/
void main( void )
{
    int     i, ret;
    char    c;

    /* マイコン機能の初期化 */
    init();                             /* 初期化                       */
    init_uart0_printf( SPEED_9600 );    /* UART0とprintf関連の初期化    */
    asm(" fset I ");                    /* 全体の割り込み許可           */

    servo_angle = 0;
    printf(
        "Servo Angle Check Soft\n"
        "'Z' key   : Angle Value -1\n"
        "'X' key   : Angle Value +1\n"
        "\n"
        "'A' key   : Angle Value -3\n"
        "'S' key   : Angle Value +3\n"
        "\n"
    );
    printf( "%3d\r", servo_angle );

    while( 1 ) {
        trdgrd1 = SERVO_CENTER - servo_angle * 22;

        i = get_uart0( &c );
        if( i == 1 ) {
            switch( c ) {
            case 'Z':
            case 'z':
                servo_angle--;
                if( servo_angle < -90 ) servo_angle = -90;
                printf( "%3d\r", servo_angle );
                break;

            case 'X':
            case 'x':
                servo_angle++;
                if( servo_angle > 90 ) servo_angle = 90;
                printf( "%3d\r", servo_angle );
                break;

            case 'A':
            case 'a':
                servo_angle -= 3;
                if( servo_angle < -90 ) servo_angle = -90;
                printf( "%3d\r", servo_angle );
                break;

            case 'S':
            case 's':
                servo_angle += 3;
                if( servo_angle > 90 ) servo_angle = 90;
                printf( "%3d\r", servo_angle );
                break;

            default:
                break;
            }
        }
    }
}

/************************************************************************/
/* R8C/38A スペシャルファンクションレジスタ(SFR)の初期化                */
/************************************************************************/
void init( void )
{
    int i;

    /* クロックをXINクロック(20MHz)に変更 */
    prc0  = 1;                          /* プロテクト解除               */
    cm13  = 1;                          /* P4_6,P4_7をXIN-XOUT端子にする*/
    cm05  = 0;                          /* XINクロック発振              */
    for(i=0; i<50; i++ );               /* 安定するまで少し待つ(約10ms) */
    ocd2  = 0;                          /* システムクロックをXINにする  */
    prc0  = 0;                          /* プロテクトON                 */

    /* ポートの入出力設定 */
    prc2 = 1;                           /* PD0のプロテクト解除          */
    pd0 = 0x00;                         /* 7-0:センサ基板Ver.5          */
    pd1 = 0xd0;                         /* 5:RXD0 4:TXD0 3-0:DIP SW     */
    p2  = 0xc0;
    pd2 = 0xfe;                         /* 7-0:モータドライブ基板Ver.5  */
    pd3 = 0xff;                         /*                              */
    p4  = 0x20;                         /* P4_5のLED:初期は点灯         */
    pd4 = 0xb8;                         /* 7:XOUT 6:XIN 5:LED 2:VREF    */
    pd5 = 0xff;                         /*                              */
    pd6 = 0xff;                         /*                              */
    pd7 = 0xff;                         /*                              */
    pd8 = 0xff;                         /*                              */
    pd9 = 0x3f;                         /*                              */
    pur0 = 0x04;                        /* P1_3～P1_0のプルアップON     */

    /* タイマRD リセット同期PWMモードの設定*/
    /* PWM周期 = 1 / 20[MHz]   * カウントソース * (TRDGRA0+1)
               = 1 / (20*10^6) * 8              * 40000
               = 0.016[s] = 16[ms]
    */
    trdpsr0 = 0x08;                     /* TRDIOB0,C0,D0端子設定        */
    trdpsr1 = 0x05;                     /* TRDIOA1,B1,C1,D1端子設定     */
    trdmr   = 0xf0;                     /* バッファレジスタ設定         */
    trdfcr  = 0x01;                     /* リセット同期PWMモードに設定  */
    trdcr0  = 0x23;                     /* ソースカウントの選択:f8      */
    trdgra0 = trdgrc0 = 39999;          /* 周期                         */
    trdgrb0 = trdgrd0 = 0;              /* P2_2端子のON幅設定           */
    trdgra1 = trdgrc1 = 0;              /* P2_4端子のON幅設定           */
    trdgrb1 = trdgrd1 = SERVO_CENTER;   /* P2_5端子のON幅設定           */
    trdoer1 = 0xcd;                     /* 出力端子の選択               */
    trdstr  = 0x0d;                     /* TRD0カウント開始             */
}

/************************************************************************/
/* end of file                                                          */
/************************************************************************/
